In [45]:
import pandas as pd


dpeople = {
    "Name": ["Alice", "Bob", "Charlie"],
    "Age": [25, 30, 35],
    "City": ["New York", "Los Angeles", "Chicago"]
}

df_people = pd.DataFrame(dpeople)


lpeople = [
    ["Allice", 25, 30000.0],
    ["Bob", 30, 40000.0],
    ["Charlie", 35, 50000.0]
]

df_people2 = pd.DataFrame(lpeople, columns=["Name", "Age", "Salary"])


# select row where Name is "Bob" and column 1 of that row
print(df_people[df_people["Name"] == "Bob"]["Age"])
print("#" * 20)

# select row 1 and column 1
print(df_people.iloc[1, 1])
print("#" * 20)

# select single cell by iat
print(df_people.iat[1, 1])
print("#" * 20)

# select single cell by lable at
print(df_people.at[1, "Age"])
print("#" * 20)

# select row where name is "Bob" using iloc
print(df_people.loc[df_people["Name"] == "Bob", ["Age"]])
print("#" * 20)

# select row where age >= 30
print(df_people[df_people["Age"] >= 30])
print("#" * 20)

# select row where age >= 30 and column "Name"
print(df_people[df_people["Age"] >= 30]["Name"])
print("#" * 20)

# select row where name end with "e" and column "Name"
print(df_people[df_people["Name"].str.endswith("e")]["Name"])
print("#" * 20)

# select last 2 rows with last 2 columns
print(df_people.iloc[-2:, -2:])
print("#" * 20)

# select last 2 rows with last 2 columns using loc
print(df_people.loc[df_people.index[-2:], df_people.columns[-2:]])
print("#" * 20)

1    30
Name: Age, dtype: int64
####################
30
####################
30
####################
30
####################
   Age
1   30
####################
      Name  Age         City
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
####################
1        Bob
2    Charlie
Name: Name, dtype: object
####################
0      Alice
2    Charlie
Name: Name, dtype: object
####################
   Age         City
1   30  Los Angeles
2   35      Chicago
####################
   Age         City
1   30  Los Angeles
2   35      Chicago
####################

In [50]:
import duckdb

#duckdb.sql("CREATE TABLE IF NOT EXIST people_table AS SELECT * FROM df_people")
duckdb.sql("DESCRIBE TABLE people_table")

┌─────────────┬─────────────┬─────────┬─────────┬─────────┬─────────┐
│ column_name │ column_type │  null   │   key   │ default │  extra  │
│   varchar   │   varchar   │ varchar │ varchar │ varchar │ varchar │
├─────────────┼─────────────┼─────────┼─────────┼─────────┼─────────┤
│ Name        │ VARCHAR     │ YES     │ NULL    │ NULL    │ NULL    │
│ Age         │ BIGINT      │ YES     │ NULL    │ NULL    │ NULL    │
│ City        │ VARCHAR     │ YES     │ NULL    │ NULL    │ NULL    │
└─────────────┴─────────────┴─────────┴─────────┴─────────┴─────────┘

In [61]:
# create new dataframe from df_people2
df_people3 = df_people2.copy()

# add column hypothetical salary
predicate = df_people3["Age"] * 1200 >= df_people3["Salary"]

# Select rows where Hypothetical Salary is greater than Salary
df_people3[predicate]

     Name  Age   Salary
0  Allice   25  30000.0